sandTrapRunDirs/0.075/system/meshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object meshDict;
}

surfaceFile "fullGeo.fms";

maxCellSize 0.08; 	//maxCellSize	0.03545;//nCellsBetweenLevels	1;//nAdditionalLayersOfRefinementNearBoundary 1;

enforceGeometryConstraints 0; 	//decomposePolyhedraIntoTetsAndPyrs 1;

boundaryCellSize 0.08; 	//boundaryCellSizeRefinementThickness	0.1;


boundaryLayers
{
    patchBoundaryLayers
    {

        walls
        {
            nLayers             3;
            OuterLayers        2;
            outerThicknessRatio 1.5;
            thicknessRatio    1.15;

            firstLayerThickness 1e-4;
            allowDiscontinuity  0;


        }

    }

}

renameBoundary
{
  defaultName fixedWalls;
  defaultType wall;
  newPatchNames
  {
    inlet
    {
      newName inlet;
      type patch;
    }
    outlet
    {
      newName outlet;
      type patch;
    }
    free_surface
    {
      newName free_surface;
      type symmetry;
    }
    walls
    {
      newName walls;
      type wall;
    }
  }
}

meshQualitySettings
{
  maxNonOrthogonality 82;
  maxSkewness 4; 	//maxInternalSkewness 4;//minTetQuality 0.8;//minDeterminant 0.001;//	minFaceTriangleTwist 1;//	minFaceTwist	1;
  surfaceMapping
  {
    maxNumIterations 1000;
    minRelDisp 0.001;
  }
  surfacePremapping
  {
    maxNumIterations 1000;
    minRelDisp 0.001;
  }
  surfaceOptimization
  {
    maxNumIterations 100;
    minRelDisp 0.001;
  }
  volumeOptimization
  {
    maxNumIterations 15;
    minRelDisp 0.001;
  }
}

workflowControls
{
} 	//stopAfter edgeExtraction;//restartFromLatestStep	1;// ************************************************************************* //

